In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":["Naman Sharma", "Punya", "Mayank","Naman Kuntal"],
    "marks":[67,78,45,87],
    "Trophies":[7,4,8,9]
    }
df = pd.DataFrame(dict1)

In [3]:
df

           name  marks  Trophies
0  Naman Sharma     67         7
1         Punya     78         4
2        Mayank     45         8
3  Naman Kuntal     87         9

In [4]:
df.to_csv("friends.csv", index = False)

In [5]:
df.head(2)

           name  marks  Trophies
0  Naman Sharma     67         7
1         Punya     78         4

In [6]:
df.tail(2)

           name  marks  Trophies
2        Mayank     45         8
3  Naman Kuntal     87         9

In [7]:
df.describe()

           marks  Trophies
count   4.000000  4.000000
mean   69.250000  7.000000
std    18.117671  2.160247
min    45.000000  4.000000
25%    61.500000  6.250000
50%    72.500000  7.500000
75%    80.250000  8.250000
max    87.000000  9.000000

In [8]:
df.index = [0.1,0.2,0.3,0.4]

In [9]:
df

             name  marks  Trophies
0.1  Naman Sharma     67         7
0.2         Punya     78         4
0.3        Mayank     45         8
0.4  Naman Kuntal     87         9

In [10]:
df1 = pd.read_csv("friends.csv")

In [11]:
df1

           name  marks  Trophies
0  Naman Sharma     67         7
1         Punya     78         4
2        Mayank     45         8
3  Naman Kuntal     87         9

In [12]:
df1

           name  marks  Trophies
0  Naman Sharma     67         7
1         Punya     78         4
2        Mayank     45         8
3  Naman Kuntal     87         9

In [13]:
df1.to_csv("friends.csv")

In [14]:
df1.sort_index(axis = 1, ascending=False)

           name  marks  Trophies
0  Naman Sharma     67         7
1         Punya     78         4
2        Mayank     45         8
3  Naman Kuntal     87         9

In [15]:
ser = pd.Series([2,3,4,5,6])

In [16]:
ser

0    2
1    3
2    4
3    5
4    6
dtype: int64

In [17]:
arr = ser.to_numpy()

In [18]:
arr

array([2, 3, 4, 5, 6])

In [19]:
type(arr)

numpy.ndarray

In [20]:
ser.to_csv("Main.csv", index=False)

In [21]:
df1

           name  marks  Trophies
0  Naman Sharma     67         7
1         Punya     78         4
2        Mayank     45         8
3  Naman Kuntal     87         9

In [22]:
df1.columns = ["A", "B","C"]

In [23]:
df1

              A   B  C
0  Naman Sharma  67  7
1         Punya  78  4
2        Mayank  45  8
3  Naman Kuntal  87  9

**Accessing a DataFrame's Element: df[COLUMN][ROW]**

In [24]:
df1["A"][0]

'Naman Sharma'

In [25]:
df1

              A   B  C
0  Naman Sharma  67  7
1         Punya  78  4
2        Mayank  45  8
3  Naman Kuntal  87  9

In [26]:
df1.loc["A", 0] = 0

In [27]:
df1 = df1.drop(0, axis=1)
df1 = df1.drop("A", axis=0)

In [28]:
df1

              A     B    C
0  Naman Sharma  67.0  7.0
1         Punya  78.0  4.0
2        Mayank  45.0  8.0
3  Naman Kuntal  87.0  9.0

**df.loc usage: df.loc[ROW, COLUMN]**

In [29]:
df1 = pd.read_csv("friends.csv")

In [30]:
df1.columns = list("ABCD")

In [31]:
df1

   A             B   C  D
0  0  Naman Sharma  67  7
1  1         Punya  78  4
2  2        Mayank  45  8
3  3  Naman Kuntal  87  9

In [32]:
df1["A"][0]

0

In [33]:
df1.loc[0,"A"] = "GoldarmGang"

In [34]:
df1

             A             B   C  D
0  GoldarmGang  Naman Sharma  67  7
1            1         Punya  78  4
2            2        Mayank  45  8
3            3  Naman Kuntal  87  9

In [35]:
df2 = pd.DataFrame(np.arange(0,1000))

In [36]:
df2

       0
0      0
1      1
2      2
3      3
4      4
..   ...
995  995
996  996
997  997
998  998
999  999

[1000 rows x 1 columns]

In [37]:
df2.head(2)

   0
0  0
1  1

In [38]:
df2.tail(2)

       0
998  998
999  999

In [39]:
df2

       0
0      0
1      1
2      2
3      3
4      4
..   ...
995  995
996  996
997  997
998  998
999  999

[1000 rows x 1 columns]

In [40]:
df

             name  marks  Trophies
0.1  Naman Sharma     67         7
0.2         Punya     78         4
0.3        Mayank     45         8
0.4  Naman Kuntal     87         9

In [41]:
df.loc[0.1, "name"] #Accessing Using loc

'Naman Sharma'

In [42]:
df["name"][0.1] #Without loc

'Naman Sharma'

**Order of rows and columns is reversed if you use loc as compared to when you use normal method**

In [43]:
df.loc[0:3, :] # Last Element  is included.

             name  marks  Trophies
0.1  Naman Sharma     67         7
0.2         Punya     78         4
0.3        Mayank     45         8
0.4  Naman Kuntal     87         9

In [44]:
df.index = [0, 1,2,3]

In [45]:
df.iloc[[0,3], [1,]] #Use iloc to access by the index count

   marks
0     67
3     87

**Querying the DataFrame**

In [46]:
df.loc[(df['name']=="Naman Sharma")]

           name  marks  Trophies
0  Naman Sharma     67         7

In [47]:
df.drop(0,inplace=True)

In [48]:
df

           name  marks  Trophies
1         Punya     78         4
2        Mayank     45         8
3  Naman Kuntal     87         9

In [49]:
df.reset_index(drop=True, inplace = True)

In [50]:
df.iloc[0, 0] =  "Nuclear King"

In [51]:
df.loc[1,'name'] = "???"

In [52]:
df.loc[0, 'name'] = "GoldarmGang"

In [53]:
df.loc[1, 'name'] = "Nuclear King"
df.loc[2, 'name'] = "???"
df.loc[3, 'name'] = "Naman Kuntal"

In [54]:
df.loc[3,'marks'] = 78

In [55]:
df.loc[3, 'Trophies'] = 7

In [56]:
df.head(2)

           name  marks  Trophies
0   GoldarmGang   78.0       4.0
1  Nuclear King   45.0       8.0

In [57]:
df.iloc[0:3, 0:2] #IMPORTANT: Last elementt is included in loc but not in iloc.

           name  marks
0   GoldarmGang   78.0
1  Nuclear King   45.0
2           ???   87.0

In [58]:
df["name"][0:3] #if you want to access elements without using loc or iloc, use individual square brackets

0     GoldarmGang
1    Nuclear King
2             ???
Name: name, dtype: object

In [59]:
df

           name  marks  Trophies
0   GoldarmGang   78.0       4.0
1  Nuclear King   45.0       8.0
2           ???   87.0       9.0
3  Naman Kuntal   78.0       7.0

In [60]:
df.loc[0:3, 'Used to play brawl'] = "True"

In [61]:
df.loc[3, 'Used to play brawl'] = np.NaN

**Start important**

In [80]:
df.loc[len(df.index)] = ['monkey', '0', '-1', True]  #adding a new row to a df

In [63]:
df = df.dropna(axis=1) #drop NaN from df

In [81]:
df.loc[:, "Hello"] = [1,2,3,4,5] #adding a new column and giving values to it
df

           name marks Trophies Hello
0   GoldarmGang  78.0      4.0     1
1  Nuclear King  45.0      8.0     2
2           ???  87.0      9.0     3
3  Naman Kuntal  78.0      7.0     4
4        monkey     0       -1     5
5        monkey     0       -1  True

**End important**

In [65]:
df2.iloc[:] = None;

In [66]:
df2

        0
0    None
1    None
2    None
3    None
4    None
..    ...
995  None
996  None
997  None
998  None
999  None

[1000 rows x 1 columns]

In [67]:
df2.loc[:, 0].isnull()

0      True
1      True
2      True
3      True
4      True
       ...
995    True
996    True
997    True
998    True
999    True
Name: 0, Length: 1000, dtype: bool

In [68]:
qqdf = pd.DataFrame({
    2:[5,9,6],
    1:[8, 12,434],
}, index=(list("ABC")))

In [69]:
qqdf

   2    1
A  5    8
B  9   12
C  6  434

In [70]:
qqdf.describe()

              2           1
count  3.000000    3.000000
mean   6.666667  151.333333
std    2.081666  244.804684
min    5.000000    8.000000
25%    5.500000   10.000000
50%    6.000000   12.000000
75%    7.500000  223.000000
max    9.000000  434.000000

In [71]:
qqdf.mean()

2      6.666667
1    151.333333
dtype: float64

In [72]:
qqdf.count()

2    3
1    3
dtype: int64

In [73]:
qqdf.corr()

          2         1
2  1.000000 -0.269492
1 -0.269492  1.000000

In [74]:
qqdf.min()

2    5
1    8
dtype: int64

In [75]:
qqdf.max()

2      9
1    434
dtype: int64

In [76]:
qqdf.std()

2      2.081666
1    244.804684
dtype: float64

In [77]:
qqdf.median()

2     6.0
1    12.0
dtype: float64

In [78]:
newdf = pd.read_excel("friends.xlsx", sheet_name="Sheet1")

ImportError: Missing optional dependency 'openpyxl'.  Use pip or conda to install openpyxl.

In [ ]:
newdf.loc[3,0] = "Naman Kuntal"

In [ ]:
newdf.drop(0, axis=1, inplace=True)

In [ ]:
newdf.loc[3, "name"] = "Naman Kuntal"

In [ ]:
newdf.loc[3, "Class"] = 8

In [ ]:
newdf.loc[[0,1], "RollNo"] = np.nan

In [ ]:
newdf

In [ ]:
newdf.to_excel("friends.xlsx")

**You can Enlarge the dataframe with loc, meaning it would add the required row and column (in either axis) if you assign a value to a row/column that currently does not exist, but apparently iloc will not do the same.**

In [ ]:
newdf.iloc[0, 2] = 0

In [ ]:
newdf.to_excel("friends.xlsx")

In [ ]:
df3 = pd.DataFrame(np.random.rand(334, 5), index=np.arange(334))

In [ ]:
df3

In [ ]:
df23 = pd.DataFrame({"name":["naman", "punya"], "roll no":[1, 29]})

In [ ]:
df23

In [ ]:
df23

In [ ]:
df23.values.tolist()